kestrel.backend.load.tests/artillery.yml
config:
  target: 'http://localhost:8085'
  phases:
    - duration: 10
      arrivalRate: 10
      name: Create external participants
  plugins:
    faker:
      locale: en
  variables:
    firstName: "$faker.name.firstName"
    lastName: "$faker.name.lastName"
    email: "$faker.internet.email"
  environments:
    iac-pko2:
        target: https://pko4.kes-team.corporater.dev
        phases:
          - duration: 600
            arrivalRate: 10
            vuc: 10

scenarios:
  - name: "Create participants"
    flow:
      - post:
          url: "/kestrel/api/graphql"
          headers:
            Authorization: "Bearer {{ $processEnvironment.KESTREL_TOKEN }}"
          json:
            query: |
              mutation CreateParticipant($firstName: String!, $lastName: String!, $email: String!) {
                createExternalParticipants(participants: [{
                  firstName: $firstName,
                  lastName: $lastName,
                  email: $email
                }]) {
                  id
                }
              }
            variables:
              firstName: "{{ firstName }}"
              lastName: "{{ lastName }}"
              email: "{{ email }}"